Revit 2027 API
BuiltInFailures.RoofFailures.RoofMeetsRoofTangentially Property
 The roofs cannot be joined because the roof being joined meets the target roof tangentially.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofMeetsRoofTangentially { get; }
Public Shared ReadOnly Property RoofMeetsRoofTangentially As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofMeetsRoofTangentially {
	FailureDefinitionId^ get ();
}
static member RoofMeetsRoofTangentially : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace